#+TITLE: Org Mode Table Tutorial
#+AUTHOR: James Stoup
#+DATE: <2025-01-23 Thu>

* Welcome to Table Madness 
Understanding Org Tables can be one of the more frustrating parts of advanced Org Mode usage. The concepts seem simple, but applying them to produce useful results can often be quite challenging. The official documentation is often a bit hard to understand and teasing out complex behavior from the core rules can often leave less experienced users giving up in frustration. To make using tables easier I've created this tutorial, which serves as a huge cheat sheet for the most common operations as well as a reference for more complex formulas.

* Org Table Basics 
If you haven't already, check out the [[https://orgmode.org/worg/org-tutorials/tables.html][offical Org Mode Tables documentation]] to get a good overview of how tables work. 




** Identifying Table Cells
Org mode uses the ~@~ symbol to denote rows and the ~$~ symbol to denote columns. As you see here:

| @1$1 | @1$2 | @1$3 |
| @2$1 | @2$2 | @2$3 |
| @3$1 | @3$2 | @3$3 |


** Creating Formulas
Create a formula by adding this to be end of any table ~#+TBLFM: <insert formula here>~

Here is a simple example. The formula should be read as "column 2 equals column 1 multiplied by 3"

| 1 |  3 |
| 2 |  6 |
| 3 |  9 |
| 4 | 12 |
| 5 | 15 |
#+TBLFM: $2=$1*3





* Common Tasks

** Auto Incrementing
Let's assume that you are keeping track of books you wish to read in a table. You want to record the book's name, whether or not you've read it, and you want a running count of the books in the table. Of course you could manually enter 1,2,3,etc. but that is tedious. A better way is to have a formula to automatically generate the indexes.

A naive attempt would be to set the value of the first column equal to number of the row. That produces this output:

| 1 | BOOKS             | READ? |
| 2 | IT                | yes   |
| 3 | The Hobbit        | yes   |
| 4 | The Black Company | yes   |
| 5 | Salem's Lot       | no    |
| 6 | Leaves of grass   | no    |
#+tblfm: $1=@#

And while that works, that isn't really want we want. Having the first index start at the title row is not how we want this to operate. Let's add a separator by adding ~|--~ to the second line and hitting the ~tab~ key. 

|   | BOOKS             | READ? |
|---+-------------------+-------|
| 2 | IT                | yes   |
| 3 | The Hobbit        | yes   |
| 4 | The Black Company | yes   |
| 5 | Salem's Lot       | no    |
| 6 | Leaves of grass   | no    |
#+tblfm: $1=@#

This is looking better! The formula is smart enough to know that we don't want to to include something before the separator. However, it still isn't correct. Even though it didn't show the first value, it still incremented it, which leaves our starting value at 2. We can do better. Modify the formula to subtract one from each value to produce the result we want.

|   | BOOKS             | READ? |
|---+-------------------+-------|
| 1 | IT                | yes   |
| 2 | The Hobbit        | yes   |
| 3 | The Black Company | yes   |
| 4 | Salem's Lot       | no    |
| 5 | Leaves of grass   | no    |
#+tblfm: $1=@#-1


** Sorting By Multiple Columns

** Summing a Column

** Summing a Row


* Simple Formulas 

** Computations on Multiple Cells
Here is a simple enough task. The field marked ~AVERAGE GRADE~ should contain an average of the 3 tests and the final exam grades. The ~CLASS GRADE~ is computed similarly but the final exam is now weighted in respect to the other grades. To generate the averages go to the first formula and execute ~C-c C-c~. To generate the class grade, do the same thing on the second formula.

| STUDENT | TEST 1 | TEST 2 | TEST 3 | FINAL EXAM | AVERAGE GRADE | CLASS GRADE |
|---------+--------+--------+--------+------------+---------------+-------------|
| Alice   |     89 |     93 |     75 |         77 |          83.5 |        82.2 |
| Bob     |     78 |     99 |     69 |         80 |          81.5 |        81.2 |
| Cathy   |     91 |     90 |     90 |         75 |          86.5 |        84.2 |
| Doug    |     48 |     90 |     85 |         82 |         76.25 |        77.4 |
#+TBLFM: $6=vmean($2..$5)
#+TBLFM: $7=($2+$3+$4+(2*$5))/5



** Averaging Values 


* Complex Formulas

* Trickery, Magic, and Other Hacks




